app/views/items/_form.html.erb

SELECT "categories".* FROM "categories"
---
<p><%= f.label :category %></p>
<%= select_tag 'category_id', options_from_collection_for_select(Category.all, 'id', 'name')%></br>