app/controllers/itemcomments_controller.rb

INSERT INTO "itemcomments" ("text", "item_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "mcmcmcmcmc"], ["item_id", 9], ["user_id", 7], ["created_at", "2017-12-20 17:51:01.045037"], ["updated_at", "2017-12-20 17:51:01.045037"]]
---
def create
	params[:itemcomment][:item_id] = params[:item_id]
	params[:itemcomment][:user_id] = current_user.id
	@comment = Itemcomment.create(itemcomments_params)